Documents/НачислениеЗадолженностиВнесудебка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>НачислениеЗадолженностиВнесудебка</Name>
			<Comment>Первый БИТ</Comment>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектамВнесудебная</xr:Item>
				<xr:Item>InformationRegister.ХранилищеДанныхТабличныхДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пересчитать</Name>
					<Comment>Если признак установлен, сумма в валюте регламентного учета будет пересчитана</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузкаВПроизвольнойВалюте</Name>
					<Comment>Если признак не установлен, задолженность будет загружена в валюте ДО</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяЗадолженность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаЗадолженности</Name>
							<Comment>Дата возникновения задолженности</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаЗагрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойДолг</Name>
							<Comment>Сумма в валюте загрузки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрафы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыборСоответствий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрыСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>Трейд Софт - не переносим</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидДвиженияЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидДвиженияЗадолженности</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СудебноеРешение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоВРаботуОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаРаботаОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоВРаботуПодразделения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаРаботаПодразделения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоДругомуПодразделению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоВРаботуСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаРаботаСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоДругомуСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженаЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашенаЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбещаниеОплатить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныйПлатеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКатегории</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НачислениеЗадолженностиВнесудебка/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийОбъекты, ТаблицаДвиженийСобытия) Экспорт
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Ссылка.МоментВремени());
	Запрос.УстановитьПараметр("Автор", ЭтотОбъект.Автор);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗагрузкаЗадолженностиОбъекты.НомерСтроки,
	               |	ЗагрузкаЗадолженностиОбъекты.Ссылка КАК Регистратор,
	               |	ЗагрузкаЗадолженностиОбъекты.ДатаЗадолженности,
	               |	ЗагрузкаЗадолженностиОбъекты.Объект,
	               |	ВЫБОР
	               |		КОГДА ЗагрузкаЗадолженностиОбъекты.ВалютаЗагрузки = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	               |			ТОГДА &ВалютаРегл
	               |		ИНАЧЕ ЗагрузкаЗадолженностиОбъекты.ВалютаЗагрузки
	               |	КОНЕЦ КАК ВалютаЗагрузки,
	               |	ЗагрузкаЗадолженностиОбъекты.ОсновнойДолг,
	               |	ЗагрузкаЗадолженностиОбъекты.Проценты,
	               |	ЗагрузкаЗадолженностиОбъекты.Штрафы,
	               |	ЗагрузкаЗадолженностиОбъекты.Пени,
	               |	ЗагрузкаЗадолженностиОбъекты.Составляющая1,
	               |	ЗагрузкаЗадолженностиОбъекты.Составляющая2,
	               |	ЗагрузкаЗадолженностиОбъекты.Составляющая3,
	               |	ЗагрузкаЗадолженностиОбъекты.Составляющая4,
	               |	ЗагрузкаЗадолженностиОбъекты.Составляющая5,
	               |	ЗагрузкаЗадолженностиОбъекты.Составляющая6,
	               |	ЗагрузкаЗадолженностиОбъекты.Составляющая7,
	               |	ЗагрузкаЗадолженностиОбъекты.Составляющая8
	               |ПОМЕСТИТЬ Объекты
	               |ИЗ
	               |	Документ.НачислениеЗадолженностиВнесудебка.Объекты КАК ЗагрузкаЗадолженностиОбъекты
	               |ГДЕ
	               |	ЗагрузкаЗадолженностиОбъекты.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Объекты.ДатаЗадолженности,
	               |	Объекты.ВалютаЗагрузки
	               |ПОМЕСТИТЬ Таб1
	               |ИЗ
	               |	Объекты КАК Объекты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Объекты.ДатаЗадолженности,
	               |	Объекты.ВалютаЗагрузки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таб1.ВалютаЗагрузки,
	               |	МАКСИМУМ(КурсыВалют.Период) КАК Период,
	               |	Таб1.ДатаЗадолженности
	               |ПОМЕСТИТЬ СрезПоДате1
	               |ИЗ
	               |	Таб1 КАК Таб1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	               |		ПО Таб1.ВалютаЗагрузки = КурсыВалют.Валюта
	               |			И Таб1.ДатаЗадолженности >= КурсыВалют.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Таб1.ВалютаЗагрузки,
	               |	Таб1.ДатаЗадолженности
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Таб1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СрезПоДате1.ДатаЗадолженности,
	               |	СрезПоДате1.ВалютаЗагрузки,
	               |	КурсыВалют.Курс * КурсыВалют.Кратность КАК КратностьНаКурс1
	               |ПОМЕСТИТЬ ИтогиПоВалютам1
	               |ИЗ
	               |	СрезПоДате1 КАК СрезПоДате1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	               |		ПО СрезПоДате1.ВалютаЗагрузки = КурсыВалют.Валюта
	               |			И СрезПоДате1.Период = КурсыВалют.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ СрезПоДате1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Объекты.НомерСтроки,
	               |	Объекты.Регистратор,
	               |	Объекты.ДатаЗадолженности,
	               |	Объекты.Объект,
	               |	Объекты.ВалютаЗагрузки,
	               |	Объекты.ОсновнойДолг,
	               |	Объекты.Проценты,
	               |	Объекты.Штрафы,
	               |	Объекты.Пени,
	               |	Объекты.Составляющая1,
	               |	Объекты.Составляющая2,
	               |	Объекты.Составляющая3,
	               |	Объекты.Составляющая4,
	               |	Объекты.Составляющая5,
	               |	Объекты.Составляющая6,
	               |	Объекты.Составляющая7,
	               |	Объекты.Составляющая8,
	               |	ДолговыеОбязательства.ВалютаДоговора
	               |ПОМЕСТИТЬ Объекты2
	               |ИЗ
	               |	Объекты КАК Объекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	               |		ПО Объекты.Объект = ДолговыеОбязательства.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Объекты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Объекты2.ДатаЗадолженности,
	               |	ДолговыеОбязательства.ВалютаДоговора
	               |ПОМЕСТИТЬ Таб2
	               |ИЗ
	               |	Объекты2 КАК Объекты2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	               |		ПО Объекты2.Объект = ДолговыеОбязательства.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Объекты2.ДатаЗадолженности,
	               |	ДолговыеОбязательства.ВалютаДоговора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таб2.ВалютаДоговора,
	               |	МАКСИМУМ(КурсыВалют.Период) КАК Период,
	               |	Таб2.ДатаЗадолженности
	               |ПОМЕСТИТЬ СрезПоДате2
	               |ИЗ
	               |	Таб2 КАК Таб2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	               |		ПО Таб2.ВалютаДоговора = КурсыВалют.Валюта
	               |			И Таб2.ДатаЗадолженности >= КурсыВалют.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Таб2.ВалютаДоговора,
	               |	Таб2.ДатаЗадолженности
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Таб2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СрезПоДате2.ДатаЗадолженности,
	               |	СрезПоДате2.ВалютаДоговора,
	               |	КурсыВалют.Курс * КурсыВалют.Кратность КАК КратностьНаКурс2
	               |ПОМЕСТИТЬ ИтогиПоВалютам2
	               |ИЗ
	               |	СрезПоДате2 КАК СрезПоДате2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	               |		ПО СрезПоДате2.ВалютаДоговора = КурсыВалют.Валюта
	               |			И СрезПоДате2.Период = КурсыВалют.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ СрезПоДате2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Объекты2.Регистратор,
	               |	Объекты2.НомерСтроки,
	               |	Объекты2.Регистратор КАК Регистратор1,
	               |	Объекты2.ДатаЗадолженности,
	               |	Объекты2.Объект,
	               |	Объекты2.ВалютаЗагрузки КАК ВалЗАГ,
	               |	Объекты2.ОсновнойДолг,
	               |	Объекты2.Проценты,
	               |	Объекты2.Штрафы,
	               |	Объекты2.Пени,
	               |	Объекты2.Составляющая1,
	               |	Объекты2.Составляющая2,
	               |	Объекты2.Составляющая3,
	               |	Объекты2.Составляющая4,
	               |	Объекты2.Составляющая5,
	               |	Объекты2.Составляющая6,
	               |	Объекты2.Составляющая7,
	               |	Объекты2.Составляющая8,
	               |	Объекты2.ВалютаДоговора КАК ВалДО,
	               |	ИтогиПоВалютам1.КратностьНаКурс1 КАК КурсЗАГ,
	               |	ИтогиПоВалютам2.КратностьНаКурс2 КАК КурсДО
	               |ПОМЕСТИТЬ Итог
	               |ИЗ
	               |	Объекты2 КАК Объекты2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиПоВалютам1 КАК ИтогиПоВалютам1
	               |		ПО Объекты2.ДатаЗадолженности = ИтогиПоВалютам1.ДатаЗадолженности
	               |			И Объекты2.ВалютаЗагрузки = ИтогиПоВалютам1.ВалютаЗагрузки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиПоВалютам2 КАК ИтогиПоВалютам2
	               |		ПО Объекты2.ДатаЗадолженности = ИтогиПоВалютам2.ДатаЗадолженности
	               |			И Объекты2.ВалютаДоговора = ИтогиПоВалютам2.ВалютаДоговора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ИтогиПоВалютам1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ИтогиПоВалютам2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Итог.НомерСтроки,
	               |	Итог.Регистратор,
	               |	Итог.ВалДО,
	               |	Итог.ВалЗАГ,
	               |	Итог.КурсДО,
	               |	Итог.КурсЗАГ,
	               |	Итог.Объект,
	               |	Итог.ДатаЗадолженности КАК Период,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = Итог.ВалДО
	               |			ТОГДА Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА (Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3) / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ (Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3) * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК СуммаДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8
	               |		ИНАЧЕ (Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8) * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК СуммаРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = Итог.ВалДО
	               |			ТОГДА Итог.ОсновнойДолг
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.ОсновнойДолг / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.ОсновнойДолг * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК ОсновнойДолгДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.ОсновнойДолг
	               |		ИНАЧЕ Итог.ОсновнойДолг * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК ОсновнойДолгРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = Итог.ВалДО
	               |			ТОГДА Итог.Проценты
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Проценты / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Проценты * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК ПроцентыДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Проценты
	               |		ИНАЧЕ Итог.Проценты * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК ПроцентыРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = Итог.ВалДО
	               |			ТОГДА Итог.Штрафы
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Штрафы / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Штрафы * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК ШтрафыДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Штрафы
	               |		ИНАЧЕ Итог.Штрафы * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК ШтрафыРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = Итог.ВалДО
	               |			ТОГДА Итог.Пени
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Пени / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Пени * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК ПениДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Пени
	               |		ИНАЧЕ Итог.Пени * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК ПениРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая1
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая1 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая1 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая1ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая1
	               |		ИНАЧЕ Итог.Составляющая1 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая1Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая2
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая2 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая2 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая2ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая2
	               |		ИНАЧЕ Итог.Составляющая2 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая2Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая3
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая3 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая3 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая3ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая3
	               |		ИНАЧЕ Итог.Составляющая3 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая3Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая4
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая4 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая4 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая4ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая4
	               |		ИНАЧЕ Итог.Составляющая4 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая4Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая5
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая5 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая5 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая5ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая5
	               |		ИНАЧЕ Итог.Составляющая5 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая5Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая6
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая6 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая6 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая6ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая6
	               |		ИНАЧЕ Итог.Составляющая6 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая6Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая7
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая7 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая7 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая7ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая7
	               |		ИНАЧЕ Итог.Составляющая7 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая7Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая8
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая8 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая8 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая8ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалЗАГ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая8
	               |		ИНАЧЕ Итог.Составляющая8 * ЕСТЬNULL(Итог.КурсЗАГ, 1)
	               |	КОНЕЦ КАК Составляющая8Регл
	               |ПОМЕСТИТЬ ДОЗагрузка
	               |ИЗ
	               |	Итог КАК Итог
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Итог
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДОЗагрузка.Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидДвиженияЗадолженности.Начисление) КАК ВидДвиженияЗадолженности,
	               |	ДОЗагрузка.Объект,
	               |	ДОЗагрузка.ВалДО КАК ВалютаДО,
	               |	ДОЗагрузка.СуммаДО,
	               |	ДОЗагрузка.СуммаРегл,
	               |	ДОЗагрузка.ОсновнойДолгДО,
	               |	ДОЗагрузка.ОсновнойДолгРегл,
	               |	ДОЗагрузка.ПроцентыДО,
	               |	ДОЗагрузка.ПроцентыРегл,
	               |	ДОЗагрузка.ШтрафыДО,
	               |	ДОЗагрузка.ШтрафыРегл,
	               |	ДОЗагрузка.ПениДО,
	               |	ДОЗагрузка.ПениРегл,
	               |	ДОЗагрузка.Составляющая1ДО,
	               |	ДОЗагрузка.Составляющая1Регл,
	               |	ДОЗагрузка.Составляющая2ДО,
	               |	ДОЗагрузка.Составляющая2Регл,
	               |	ДОЗагрузка.Составляющая3ДО,
	               |	ДОЗагрузка.Составляющая3Регл,
	               |	ДОЗагрузка.Составляющая4ДО,
	               |	ДОЗагрузка.Составляющая4Регл,
	               |	ДОЗагрузка.Составляющая5ДО,
	               |	ДОЗагрузка.Составляющая5Регл,
	               |	ДОЗагрузка.Составляющая6ДО,
	               |	ДОЗагрузка.Составляющая6Регл,
	               |	ДОЗагрузка.Составляющая7ДО,
	               |	ДОЗагрузка.Составляющая7Регл,
	               |	ДОЗагрузка.Составляющая8ДО,
	               |	ДОЗагрузка.Составляющая8Регл
	               |ИЗ
	               |	ДОЗагрузка КАК ДОЗагрузка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДОЗагрузка.Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗагруженаЗадолженность) КАК ВидСобытия,
	               |	ДОЗагрузка.Регистратор КАК ИсточникСобытия,
	               |	ДОЗагрузка.Объект,
	               |	&Автор,
	               |	ДОЗагрузка.СуммаРегл КАК СуммаДокумента
	               |ИЗ
	               |	ДОЗагрузка КАК ДОЗагрузка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ДОЗагрузка";					   
	Результат = Запрос.ВыполнитьПакет();                             
	ТаблицаДвиженийОбъекты = Результат[Результат.ВГраница() - 2].Выгрузить();
	ТаблицаДвиженийСобытия = Результат[Результат.ВГраница() - 1].Выгрузить();
КонецПроцедуры

Процедура ПровестиПоследовательность(ЭтотОбъект) Экспорт
	//Корректировка последовательности, поиск первого документа актуализации и его ПРОГРАММНОЕ перепроведение
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПоступлениеПлатежа.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ПоступлениеПлатежа КАК ПоступлениеПлатежа
	                      |ГДЕ
	                      |	ПоступлениеПлатежа.Займ = &Займ
	                      |	И ПоступлениеПлатежа.ДатаПлатежа >= &МоментВремени
	                      |	И ПоступлениеПлатежа.Проведен = ИСТИНА
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПоступлениеПлатежа.ДатаПлатежа");
	Для Каждого Стр из ЭтотОбъект.Объекты Цикл
		Запрос.УстановитьПараметр("Займ", стр.Объект);
		Запрос.УстановитьПараметр("МоментВремени", стр.ДатаЗадолженности);
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			ДокументОбъект = Результат.Ссылка.ПолучитьОбъект();
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ДокументОбъект.НеразнесеннаяСумма = ДокументОбъект.СуммаПлатежа;
			ДокументОбъект.РаспределитьПоСудебнымРешениям();
			ДокументОбъект.РаспределитьПоВнесудебке();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
